In [1]:
import numpy as np
import pandas as pd

In [2]:
sozluk1 = {"Isim": ["Ali","Zeynep","Barlas","Şeyma"],
           "Spor":["Koşu","Yüzme","Koşu","Baketbol"],
          "Kalori": [100,200,300,400]
          }

In [3]:
dataFrame1 = pd.DataFrame(sozluk1,index=[0,1,2,3])

In [4]:
dataFrame1

     Isim      Spor  Kalori
0     Ali      Koşu     100
1  Zeynep     Yüzme     200
2  Barlas      Koşu     300
3   Şeyma  Baketbol     400

In [5]:
sozluk2 = {"Isim": ["Ela","Levent","Leyla","Bülent"],
           "Spor":["Koşu","Yüzme","Koşu","Baketbol"],
          "Kalori": [200,100,50,300]
          }

In [6]:
dataFrame2 = pd.DataFrame(sozluk2,index=[4,5,6,7])

In [7]:
sozluk3 = {"Isim": ["Kasım","Eylül","Fırat","Ceyda"],
           "Spor":["Koşu","Yüzme","Badminton","Tenis"],
          "Kalori": [300,400,500,250]
          }

In [8]:
dataFrame3 = pd.DataFrame(sozluk3,index=[8,9,10,11])

In [11]:
dataFrame2

     Isim      Spor  Kalori
4     Ela      Koşu     200
5  Levent     Yüzme     100
6   Leyla      Koşu      50
7  Bülent  Baketbol     300

In [12]:
dataFrame3

     Isim       Spor  Kalori
8   Kasım       Koşu     300
9   Eylül      Yüzme     400
10  Fırat  Badminton     500
11  Ceyda      Tenis     250

## concatenation

In [13]:
## birleştirmek

In [15]:
pd.concat([dataFrame1,dataFrame2,dataFrame3],axis=0)

      Isim       Spor  Kalori
0      Ali       Koşu     100
1   Zeynep      Yüzme     200
2   Barlas       Koşu     300
3    Şeyma   Baketbol     400
4      Ela       Koşu     200
5   Levent      Yüzme     100
6    Leyla       Koşu      50
7   Bülent   Baketbol     300
8    Kasım       Koşu     300
9    Eylül      Yüzme     400
10   Fırat  Badminton     500
11   Ceyda      Tenis     250

## merge

In [16]:
## kaynaştırmak

In [17]:
mergeSozluk1 = {"Isim" : ["Ali","Zeynep","Barlas","Şeyma"],
               "Spor" : ["Koşu","Yüzme","Koşu","Basketbol"],
               }

In [18]:
mergeDataFrame1 = pd.DataFrame(mergeSozluk1)

In [19]:
mergeDataFrame1

     Isim       Spor
0     Ali       Koşu
1  Zeynep      Yüzme
2  Barlas       Koşu
3   Şeyma  Basketbol

In [20]:
mergeSozluk2 = {"Isim" : ["Ali","Zeynep","Barlas","Şeyma"],
               "Kalori" : [100,200,150,250],
               }

In [21]:
mergeDataFrame2 = pd.DataFrame(mergeSozluk2)

In [22]:
mergeDataFrame2

     Isim  Kalori
0     Ali     100
1  Zeynep     200
2  Barlas     150
3   Şeyma     250

In [23]:
pd.merge(mergeDataFrame1,mergeDataFrame2,on="Isim")

     Isim       Spor  Kalori
0     Ali       Koşu     100
1  Zeynep      Yüzme     200
2  Barlas       Koşu     150
3   Şeyma  Basketbol     250

## ileri operasyonlar

In [24]:
maasSozluk = {"Isim":["Sumeyye","Aslı","Serkan","Emre"],
             "Departman": ["Yazılım","Satış","Pazarlama","Yazılım"],
              "Maas" : [200,300,400,500]
             }

In [25]:
maasDataFrame = pd.DataFrame(maasSozluk)

In [26]:
maasDataFrame

      Isim  Departman  Maas
0  Sumeyye    Yazılım   200
1     Aslı      Satış   300
2   Serkan  Pazarlama   400
3     Emre    Yazılım   500

In [28]:
maasDataFrame["Departman"].unique()

array(['Yazılım', 'Satış', 'Pazarlama'], dtype=object)

In [32]:
maasDataFrame["Departman"].nunique() ##number of unique yani kaç tane numarasını getir

3

In [33]:
maasDataFrame["Departman"].value_counts()

Yazılım      2
Satış        1
Pazarlama    1
Name: Departman, dtype: int64

In [36]:
def bruttenNete(maas):
    return maas * 0.66

In [37]:
maasDataFrame["Maas"].apply(bruttenNete)

0    132.0
1    198.0
2    264.0
3    330.0
Name: Maas, dtype: float64

In [38]:
maasDataFrame.isnull()

    Isim  Departman   Maas
0  False      False  False
1  False      False  False
2  False      False  False
3  False      False  False

In [43]:
yeniBirVeri = {"Karakter Sınıfı": ["South Park","South Park","Simpson","Simpson","Simpson"],
              "Karakter Ismi" : ["Cartman","Kenny","Homer","Bart","Bart"],
               "Karakter Yas" : [9,10,50,20,10]
              }

In [44]:
karakterDF = pd.DataFrame(yeniBirVeri)

In [45]:
karakterDF

  Karakter Sınıfı Karakter Ismi  Karakter Yas
0      South Park       Cartman             9
1      South Park         Kenny            10
2         Simpson         Homer            50
3         Simpson          Bart            20
4         Simpson          Bart            10

In [48]:
karakterDF.pivot_table(values="Karakter Yas",index=["Karakter Sınıfı","Karakter Ismi"],aggfunc=np.sum) # aggfunc olmadan Bart'ın yaş ortalamasını aldı

                               Karakter Yas
Karakter Sınıfı Karakter Ismi
Simpson         Bart                     30
                Homer                    50
South Park      Cartman                   9
                Kenny                    10